[
  {
    "user": "baosang",
    "text": "hello, what is your name?",
    "date": "2025-06-13T12:56:02.011Z",
    "type": "text",
    "title": "baosang",
    "position": "right"
  },
  {
    "user": "bot",
    "text": "Hey there! I don't have a name like a human does, but you can call me Bard. Nice to meet you!\n\nSo, what are you hoping to chat about today? Got anything interesting on your mind?\n",
    "date": "2025-06-13T12:56:04.230Z",
    "type": "text",
    "title": "AI Agent",
    "position": "left"
  },
  {
    "user": "baosang",
    "text": "hello hello how are you",
    "date": "2025-06-13T12:57:51.277Z",
    "type": "text",
    "title": "baosang",
    "position": "right"
  },
  {
    "user": "bot",
    "text": "Hello hello! I'm doing well, thanks for asking! Just hanging out here, ready to chat and help out however I can.\n\nSo, what's on your mind today? Anything interesting you're working on or thinking about?\n",
    "date": "2025-06-13T12:57:52.425Z",
    "type": "text",
    "title": "AI Agent",
    "position": "left"
  },
  {
    "user": "baosang",
    "text": "Evanston in about a new company",
    "date": "2025-06-13T12:58:09.769Z",
    "type": "text",
    "title": "baosang",
    "position": "right"
  },
  {
    "user": "bot",
    "text": "Okay, so you're interested in hearing about a new company in Evanston? That's great! To give you the best information, tell me a little more about what you're looking for. For example:\n\n*   **What kind of company are you interested in?** (Tech, food, retail, service industry, etc.)\n*   **Are you looking for job opportunities?**\n*   **Are you interested in the company's products or services?**\n*   **Are you interested in its community involvement?**\n\nOnce I know a bit more about what you're hoping to find, I can give you some more specific and relevant information.\n\nIn the meantime, I can share some general trends. Evanston has a pretty vibrant startup scene, especially in areas like tech, sustainable businesses, and social enterprises. There's a lot of focus on innovation and community impact.\n\nSo, what sparks your curiosity most about new companies in Evanston?\n",
    "date": "2025-06-13T12:58:11.614Z",
    "type": "text",
    "title": "AI Agent",
    "position": "left"
  }
]